Revit 2027 API
FieldBuilder.SetSpec Method
 Sets the spec describing the field's values.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FieldBuilder SetSpec(
	ForgeTypeId specTypeId
)
Public Function SetSpec (
	specTypeId As ForgeTypeId
) As FieldBuilder
public:
FieldBuilder^ SetSpec(
	ForgeTypeId^ specTypeId
)
member SetSpec :
        specTypeId : ForgeTypeId -> FieldBuilder
Parameters
specTypeId ForgeTypeId
 Identifier of the spec.
Return Value
FieldBuilder
 The FieldBuilder object may be used to add more details to the field.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The SchemaBuilder has already finished building the Schema. -or- The field type does not utilize unit conversions.
See Also
Reference
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace